src/src/Catalogs/AutomaticDiscountTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>AutomaticDiscountTypes</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Acts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AssignmentMethod</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountValueType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Purpose</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountsArea</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AssignmentArea</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountApplyingArea</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountMarkupValue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RestrictionByProductsVariant</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountApplyingFilterType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsRestrictionOnRecipientsCounterparties</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsRestrictionByRecipientsWarehouses</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ThereIsSchedule</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalOrderingAttribute</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClarificationByProducts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClarificationByProductsCategories</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClarificationByPriceGroups</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AssignmentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SharedUsageVariant</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DiscountsApplyingRules</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ThereAreFoldersToBeClarifiedByProducts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>TimeByDaysOfWeek</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Selected</Name>
							<Comment>(Common) Shows a selected day of the week</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>WeekDay</Name>
							<Comment>(Common) Day of the week</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.WeekDays</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BeginTime</Name>
							<Comment>(Common) Discount validity start time</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EndTime</Name>
							<Comment>(Common) Discount expiration time</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ProductsGroupsPriceGroups</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ValueClarification</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Products</v8:Type>
								<v8:Type>cfg:CatalogRef.ProductsCategories</v8:Type>
								<v8:Type>cfg:CatalogRef.PriceGroups</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DiscountMarkupValue</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ProductsCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ConditionsOfAssignment</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>AssignmentCondition</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DiscountConditions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DiscountRecipientsCounterparties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Recipient</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DiscountRecipientsWarehouses</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Recipient</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/InformationRegisters/ServiceAutomaticDiscounts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ServiceAutomaticDiscounts</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ScheduleDiscountsAvailable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WarehouseRecipientDiscountsAvailable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CounterpartyRecipientDiscountsAvailable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountDependingDiscountsAvailable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PurchaseSetDependingDiscountsAvailable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ServiceMeasurement</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/Enums/DiscountApplyingFilterType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>DiscountApplyingFilterType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ByProducts</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ByProductsCategories</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ByPriceGroups</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/DiscountValueType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>DiscountValueType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Amount</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Percent</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/DiscountCondition.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>DiscountCondition</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ForOneTimeSalesVolume</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ForKitPurchase</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/DiscountSalesAmountLimit.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>DiscountSalesAmountLimit</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Amount</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Quantity</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Catalogs/AutomaticDiscountTypes/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region PredeterminedProceduresEventsHandlers

// Procedure - BeforeWrite event handler.
//
Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not IsFolder Then
		
		If DeletionMark AND Acts Then
			Acts = False;
		EndIf;
		
		IsClarificationByProducts = ?(RestrictionByProductsVariant = Enums.DiscountApplyingFilterType.ByProducts, ProductsGroupsPriceGroups.Count() > 0, False);
		IsClarificationByProductsCategories = ?(RestrictionByProductsVariant = Enums.DiscountApplyingFilterType.ByProductsCategories, ProductsGroupsPriceGroups.Count() > 0, False);
		IsClarificationByPriceGroups = ?(RestrictionByProductsVariant = Enums.DiscountApplyingFilterType.ByPriceGroups, ProductsGroupsPriceGroups.Count() > 0, False);
		
		ThereIsSchedule = False;
		For Each CurrentTimetableString In TimeByDaysOfWeek Do
			If CurrentTimetableString.Selected Then
				ThereIsSchedule = True;
				Break;
			EndIf;
		EndDo;
		
		IsRestrictionOnRecipientsCounterparties = DiscountRecipientsCounterparties.Count() > 0;
		IsRestrictionByRecipientsWarehouses = DiscountRecipientsWarehouses.Count() > 0;
		
		If RestrictionByProductsVariant = Enums.DiscountApplyingFilterType.ByProducts Then
			Query = New Query;
			Query.Text = 
				"SELECT
				|	AutomaticDiscountsProductsGroupsPriceGroups.ValueClarification
				|INTO TU_AutomaticDiscountsProductsGroupsPriceGroups
				|FROM
				|	&ProductsGroupsPriceGroups AS AutomaticDiscountsProductsGroupsPriceGroups
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|SELECT TOP 1
				|	TU_AutomaticDiscountsProductsGroupsPriceGroups.ValueClarification
				|FROM
				|	TU_AutomaticDiscountsProductsGroupsPriceGroups AS TU_AutomaticDiscountsProductsGroupsPriceGroups
				|WHERE
				|	TU_AutomaticDiscountsProductsGroupsPriceGroups.ValueClarification.IsFolder";
			
			Query.SetParameter("ByProducts", RestrictionByProductsVariant);
			Query.SetParameter("ProductsGroupsPriceGroups", ProductsGroupsPriceGroups.Unload());
			
			Result = Query.Execute();
			
			ThereAreFoldersToBeClarifiedByProducts = Not Result.IsEmpty();
		Else
			ThereAreFoldersToBeClarifiedByProducts = False;
		EndIf;
		
		// To remove rows without conditions.
		MRowsToDelete = New Array;
		For Each CurrentCondition In ConditionsOfAssignment Do
			If CurrentCondition.AssignmentCondition.IsEmpty() Then
				MRowsToDelete.Add(CurrentCondition);
			EndIf;
		EndDo;
		
		For Each RemovedRow In MRowsToDelete Do
			ConditionsOfAssignment.Delete(RemovedRow);
		EndDo;
		
	EndIf;
	
EndProcedure

// Procedure - FillCheckProcessing event handler.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If IsFolder Then
		Return;
	EndIf;
	
	NoncheckableAttributeArray = New Array;
	
	If AssignmentMethod <> Enums.DiscountValueType.Amount Then
		NoncheckableAttributeArray.Add("AssignmentCurrency");
	EndIf;
	
	CommonUse.DeleteUnverifiableAttributesFromArray(CheckedAttributes, NoncheckableAttributeArray);
	
EndProcedure

// Procedure - FillingProcessor event handler.
//
Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If Not IsFolder Then
		AssignmentCurrency = Constants.PresentationCurrency.Get();
	Else
		SharedUsageVariant = Constants.DefaultDiscountsApplyingRule.Get();
	EndIf;
	
EndProcedure

Procedure UpdateInformationInServiceInformationRegister(Cancel)
	
	SetPrivilegedMode(True);
	
	// Update information in service information register used to optimize
	// number of cases which require to calculate automatic discounts.
	RecordManager = InformationRegisters.ServiceAutomaticDiscounts.CreateRecordManager();
	
	Block = New DataLock;
	LockItem = Block.Add();
	LockItem.Region = "InformationRegister.ClosingDates";
	LockItem.Mode = DataLockMode.Exclusive;
	
	BeginTransaction();
	Try
		Block.Lock();
		RecordManager.Read();
			
		Query = New Query;
		Query.Text = 
			"SELECT ALLOWED TOP 1
			|	TRUE AS Field1
			|FROM
			|	Catalog.AutomaticDiscountTypes.ConditionsOfAssignment AS AutomaticDiscountsAssignmentCondition
			|WHERE
			|	AutomaticDiscountsAssignmentCondition.AssignmentCondition.AssignmentCondition = &ForOneTimeSalesVolume
			|	AND AutomaticDiscountsAssignmentCondition.AssignmentCondition.UseRestrictionCriterionForSalesVolume = &Amount
			|	AND AutomaticDiscountsAssignmentCondition.Ref.Acts
			|	AND Not AutomaticDiscountsAssignmentCondition.Ref.DeletionMark
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT ALLOWED TOP 1
			|	TRUE AS Field1
			|FROM
			|	Catalog.AutomaticDiscountTypes.ConditionsOfAssignment AS AutomaticDiscountsAssignmentCondition
			|WHERE
			|	AutomaticDiscountsAssignmentCondition.AssignmentCondition.AssignmentCondition = &ForKitPurchase
			|	AND AutomaticDiscountsAssignmentCondition.Ref.Acts
			|	AND Not AutomaticDiscountsAssignmentCondition.Ref.DeletionMark
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT ALLOWED TOP 1
			|	TRUE AS Field1
			|FROM
			|	Catalog.AutomaticDiscountTypes.DiscountRecipientsCounterparties AS AutomaticDiscountsDiscountRecipientsCounterparties
			|WHERE
			|	AutomaticDiscountsDiscountRecipientsCounterparties.Ref.Acts
			|	AND Not AutomaticDiscountsDiscountRecipientsCounterparties.Ref.DeletionMark
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT ALLOWED TOP 1
			|	TRUE AS Field1
			|FROM
			|	Catalog.AutomaticDiscountTypes.DiscountRecipientsWarehouses AS AutomaticDiscountsDiscountRecipientsWarehouses
			|WHERE
			|	AutomaticDiscountsDiscountRecipientsWarehouses.Ref.Acts
			|	AND Not AutomaticDiscountsDiscountRecipientsWarehouses.Ref.DeletionMark
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT ALLOWED TOP 1
			|	TRUE AS Field1
			|FROM
			|	Catalog.AutomaticDiscountTypes.TimeByDaysOfWeek AS AutomaticDiscountsTimeByWeekDays
			|WHERE
			|	AutomaticDiscountsTimeByWeekDays.Ref.Acts
			|	AND Not AutomaticDiscountsTimeByWeekDays.Ref.DeletionMark
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|SELECT ALLOWED TOP 1
			|	TRUE AS Field1
			|FROM
			|	Catalog.AutomaticDiscountTypes AS AutomaticDiscountTypes
			|WHERE
			|	Not AutomaticDiscountTypes.DeletionMark
			|	AND AutomaticDiscountTypes.Acts";
		
		Query.SetParameter("ForOneTimeSalesVolume", Enums.DiscountCondition.ForOneTimeSalesVolume);
		Query.SetParameter("ForKitPurchase", Enums.DiscountCondition.ForKitPurchase);
		Query.SetParameter("Amount", Enums.DiscountSalesAmountLimit.Amount);
		Query.SetParameter("Ref", Ref);
		
		MResults = Query.ExecuteBatch();
		
		// There is a discount depending on the amount.
		Selection = MResults[0].Select();
		RecordManager.AmountDependingDiscountsAvailable = Selection.Next();
		
		// There is a discount for complete purchase.
		Selection = MResults[1].Select();
		RecordManager.PurchaseSetDependingDiscountsAvailable = Selection.Next();
		
		// There are discounts with restriction by counterparties.
		Selection = MResults[2].Select();
		RecordManager.CounterpartyRecipientDiscountsAvailable = Selection.Next();
		
		// There are discounts with restriction by counterparties.
		Selection = MResults[3].Select();
		RecordManager.WarehouseRecipientDiscountsAvailable = Selection.Next();
		
		// There are discounts with timetable.
		Selection = MResults[4].Select();
		RecordManager.ScheduleDiscountsAvailable = Selection.Next();
		
		RecordManager.Write();
		
		// There are applicable discounts.
		Selection = MResults[5].Select();
		Constants.ThereAreAutomaticDiscounts.Set(Selection.Next());
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Cancel = True;
		ErrorPresentation = BriefErrorDescription(ErrorInfo());
	EndTry;
	
	SetPrivilegedMode(False);
	
	WriteLogEvent(
			NStr("en = 'Automatic discounts.Service information on automatic discounts'",
			     CommonUseClientServer.MainLanguageCode()),
			?(Cancel, EventLogLevel.Error, EventLogLevel.Information),
			,
			,
			ErrorPresentation,
			EventLogEntryTransactionMode.Independent);
	
	If Cancel Then
		Raise
			NStr("en = 'Failed to record service information on automatic discounts and extra charges.
			     |Details in the event log.'");
	EndIf;
	
EndProcedure

// Procedure - event handler OnWrite.
//
Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then
		If Not (AdditionalProperties.Property("RegisterServiceAutomaticDiscounts")
			AND AdditionalProperties.RegisterServiceAutomaticDiscounts = False) Then
			UpdateInformationInServiceInformationRegister(Cancel);
		EndIf;
		
		Return;
	EndIf;
	
	UpdateInformationInServiceInformationRegister(Cancel);
	
EndProcedure

#EndRegion

#EndIf
